app/controllers/comments_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES ('Pavan', 'Ruby Names', 3, '2011-07-25 11:32:18.265343', '2011-07-25 11:32:18.265343')
---
    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.create(params[:comment])

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 4 AND (`comments`.post_id = 3) LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 4
---
    def destroy
        @post = Post.find(params[:post_id])
        @comment = @post.comments.find(params[:id])
        @comment.destroy