app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "title", "content", "created_at", "updated_at") VALUES ('Pavan', 'Ruby Names', 'Ruby Names are used to refer to constants, variables, methods, classes, and modules. The first character of a name helps Ruby to distinguish its intended use. Certain names, are reserved words and should not be used as variable, method, class, or module name. Lowercase letter means the characters "a" through "z". Uppercase letter means ''''A'''' through ''''Z,'''' and digit means "0" through "9". A name is an uppercase letter, lowercase letter, or an underscore ("_"), followed by Name characters (this is any combination of upper- and lowercase letters, underscore and digits).
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE "posts" SET "name" = 'knfklnvlksvn', "title" = 'lndlvbdf;bl', "content" = 'nlvnhnloblsfdknvl', "updated_at" = '2011-07-26 10:45:52.050581' WHERE "posts"."id" = 20
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])